In [14]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('employee_dataset.csv')

In [3]:
df.shape

(300000, 8)

In [4]:
df.columns

Index(['Name', 'Company_Name', 'Employee_Job_Title', 'Employee_City',
       'Employee_Country', 'Employee_Salary', 'Employment_Status',
       'Employee_Rating'],
      dtype='object')

In [5]:
df['Employee_Salary'].mean()

500224.20772666665

In [7]:
df[df['Company_Name']=='Nichols-James'].size

159288

In [11]:
df['Employee_Salary'].agg(['min','max','median'])

min            0.0
max       999990.0
median    500780.0
Name: Employee_Salary, dtype: float64

In [30]:
# company with most employees
# company with least employees
df.groupby(by=['Company_Name']).size().idxmax(),df.groupby(by=['Company_Name']).size().idxmin()

('Scott Inc', 'Wallace, Smith and Shepard')

In [35]:
df.loc[df['Employee_Salary'].idxmax()]

Name                          Anna Lawson
Company_Name                 Taylor-Ramos
Employee_Job_Title    Production engineer
Employee_City                 Kristaburgh
Employee_Country                  Lesotho
Employee_Salary                    999990
Employment_Status               Full Time
Employee_Rating                       4.0
Name: 70356, dtype: object

In [36]:
# Print the Company_Name with most number of employees in 'Wardfort' city.
df[df['Employee_City']=='Wardfort'].groupby(by=['Company_Name']).size().idxmax()

'White, Mcclain and Cobb'

In [37]:
# Change the Data type of 'Employee_Salary' column to float
df['Employee_Salary'] = df['Employee_Salary'].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 8 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Name                300000 non-null  object
 1   Company_Name        300000 non-null  object
 2   Employee_Job_Title  300000 non-null  object
 3   Employee_City       300000 non-null  object
 4   Employee_Country    300000 non-null  object
 5   Employee_Salary     300000 non-null  float64
 6   Employment_Status   300000 non-null  object
 7   Employee_Rating     300000 non-null  float64
dtypes: float64(2), object(6)
memory usage: 18.3+ MB

In [42]:
# Print the Company_Name with the most number of Full-time Employees. 
df[df['Employment_Status']=='Full Time'].groupby(by=['Company_Name']).size().idxmax()

'Scott Inc'

In [44]:
#  Print the Company_Name with the highest average 'Employee_Rating'. 
df.groupby(by=['Company_Name'])['Employee_Rating'].mean().idxmax()

'Matthews Inc'

In [50]:
# Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined
df[(df['Employee_City']=='Ricardomouth')|(df['Employee_City']=='Kristaburgh')].size

482048

In [64]:
# Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.
df['salary_rank'] = df['Employee_Salary'].rank(ascending=False)
df[df['salary_rank'] <= 5]['Company_Name'].unique()

array(['Campos, Reynolds and Mccormick', 'White, Mcclain and Cobb',
       'Thomas-Spencer', 'Taylor-Ramos'], dtype=object)

In [67]:
# Check if there are any duplicate rows in the DataFrame. 
len(df[df.duplicated()])

0

In [69]:
# Check if any of the columns has NaN values. 
df.isna().any()

Name                  False
Company_Name          False
Employee_Job_Title    False
Employee_City         False
Employee_Country      False
Employee_Salary       False
Employment_Status     False
Employee_Rating       False
salary_rank           False
dtype: bool

In [70]:
# Print the data type of every column in the DataFrame.
df.dtypes

Name                   object
Company_Name           object
Employee_Job_Title     object
Employee_City          object
Employee_Country       object
Employee_Salary       float64
Employment_Status      object
Employee_Rating       float64
salary_rank           float64
dtype: object

In [77]:
# Find the employee which has the maximum salary among the ones with  the minimum Employee_Rating 
tmp_df = df[df['Employee_Rating'] == df['Employee_Rating'].min()]
tmp_df[tmp_df['salary_rank']==tmp_df['salary_rank'].max()]['Name']

155748    Steven Osborne
Name: Name, dtype: object

In [85]:
# Print the number of employees whose last name starts with the letter 'R'. 
len(df[df['Name'].str.startswith('R')])

17940

In [100]:
# Starting from the first record, print every third record in the DataFrame.
df.iloc[::3]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating,salary_rank
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520.0,Full Time,3.9,203737.5
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400.0,Full Time,3.1,265264.0
6,Kelly Brown,Andrade LLC,Naval architect,Wardfort,Aruba,711410.0,Full Time,2.0,86289.0
9,Michael Edwards,"Campos, Reynolds and Mccormick",Ergonomist,New Cindychester,Lao People's Democratic Republic,516950.0,Full Time,2.3,145194.0
12,Tiffany Galvan,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,West Jamesview,Niger,786430.0,Intern,3.6,64068.5
...,...,...,...,...,...,...,...,...,...
299985,Chase Stevens,Nelson-Li,Energy manager,Whitakerbury,Northern Mariana Islands,590590.0,Full Time,2.6,122864.0
299988,Kenneth Hurley,Scott Inc,Make,New Russellton,Russian Federation,211180.0,Full Time,3.9,236810.0
299991,William Rodriguez,Scott Inc,Ergonomist,Whiteside,New Zealand,214400.0,Full Time,1.5,235786.0
299994,Kelly Bennett,"White, Mcclain and Cobb","Radiographer, therapeutic",Wardfort,Fiji,182270.0,Full Time,3.6,245446.5
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830.0,Full Time,0.6,59097.0

In [102]:
# Find the average salary for every company.
df.groupby(by=['Company_Name'])['Employee_Salary'].mean()

Company_Name
Andrade LLC                       497237.159385
Baker, Allen and Edwards          498032.358445
Bullock-Carrillo                  499603.804865
Campos, Reynolds and Mccormick    503528.982687
James and Sons                    503581.015754
Johnston, Fleming and Tanner      500579.128010
Marshall-Holloway                 502314.169445
Matthews Inc                      501640.159488
Nelson-Li                         500569.824558
Nichols-James                     497881.232334
Scott Inc                         500491.809024
Taylor-Ramos                      498747.292516
Thomas-Spencer                    499350.850164
Wallace, Smith and Shepard        500807.608810
White, Mcclain and Cobb           499083.493806
Name: Employee_Salary, dtype: float64

In [104]:
# Find the average salary and average rating for every company in a single line.
df.groupby(by=['Company_Name']).agg({'Employee_Salary':'mean','Employee_Rating':'mean'})

                                Employee_Salary  Employee_Rating
Company_Name
Andrade LLC                       497237.159385         2.498218
Baker, Allen and Edwards          498032.358445         2.504795
Bullock-Carrillo                  499603.804865         2.502014
Campos, Reynolds and Mccormick    503528.982687         2.506288
James and Sons                    503581.015754         2.505023
Johnston, Fleming and Tanner      500579.128010         2.513159
Marshall-Holloway                 502314.169445         2.504900
Matthews Inc                      501640.159488         2.525454
Nelson-Li                         500569.824558         2.504649
Nichols-James                     497881.232334         2.488554
Scott Inc                         500491.809024         2.515993
Taylor-Ramos                      498747.292516         2.513150
Thomas-Spencer                    499350.850164         2.505114
Wallace, Smith and Shepard        500807.608810         2.497402
White, Mcclain and Cobb           499083.493806         2.504047

In [105]:
df.groupby(by=['Company_Name'])['Employee_City'].nunique()

Company_Name
Andrade LLC                       10
Baker, Allen and Edwards          10
Bullock-Carrillo                  10
Campos, Reynolds and Mccormick    10
James and Sons                    10
Johnston, Fleming and Tanner      10
Marshall-Holloway                 10
Matthews Inc                      10
Nelson-Li                         10
Nichols-James                     10
Scott Inc                         10
Taylor-Ramos                      10
Thomas-Spencer                    10
Wallace, Smith and Shepard        10
White, Mcclain and Cobb           10
Name: Employee_City, dtype: int64

In [112]:
# Print the job title with the most employees corresponding to every company. 
df.groupby(by=['Company_Name','Employee_Job_Title']).size().groupby('Company_Name').idxmax()

Company_Name
Andrade LLC                       (Andrade LLC, Diplomatic Services operational ...
Baker, Allen and Edwards          (Baker, Allen and Edwards, Diplomatic Services...
Bullock-Carrillo                  (Bullock-Carrillo, Diplomatic Services operati...
Campos, Reynolds and Mccormick    (Campos, Reynolds and Mccormick, Diplomatic Se...
James and Sons                    (James and Sons, Diplomatic Services operation...
Johnston, Fleming and Tanner      (Johnston, Fleming and Tanner, Diplomatic Serv...
Marshall-Holloway                 (Marshall-Holloway, Diplomatic Services operat...
Matthews Inc                      (Matthews Inc, Diplomatic Services operational...
Nelson-Li                         (Nelson-Li, Diplomatic Services operational of...
Nichols-James                     (Nichols-James, Diplomatic Services operationa...
Scott Inc                         (Scott Inc, Diplomatic Services operational of...
Taylor-Ramos                      (Taylor-Ramos, Diplomatic Services operational...
Thomas-Spencer                    (Thomas-Spencer, Diplomatic Services operation...
Wallace, Smith and Shepard        (Wallace, Smith and Shepard, Diplomatic Servic...
White, Mcclain and Cobb           (White, Mcclain and Cobb, Diplomatic Services ...
dtype: object

In [116]:
df.groupby(by=['Company_Name','Employee_Job_Title']).size().reset_index()[0].rank()

0       77.0
1      269.0
2      100.5
3      278.0
4      216.0
       ...
280    198.0
281    141.0
282    191.0
283    111.5
284    131.5
Name: 0, Length: 285, dtype: float64

In [ ]:
# using apply
df['AgeCategory'] = df['Age'].apply(lambda x: '30+' if x >= 30 else '-30')

In [ ]:
# using map function

# Define a custom function for age categorization
def categorize_age(age):
    if age < 30:
        return 'Youth'
    elif age <= 50:
        return 'Middle Age'
    else:
        return 'Senior'

# Use map() to apply the custom function to the 'Age' column
df_csv['AgeGroup'] = df_csv['Age'].map(categorize_age)

In [121]:
# Dropping rows with any missing values
df_dropped = df.dropna()

Name                  False
Company_Name          False
Employee_Job_Title    False
Employee_City         False
Employee_Country      False
Employee_Salary       False
Employment_Status     False
Employee_Rating       False
salary_rank           False
dtype: bool

In [ ]:
# Creating a date column with date range and defining frequency
dates = pd.date_range(start='2020-01-01', end='2020-12-31', freq='M')

In [127]:
# Using custom aggregation functions
df.groupby('Company_Name').agg({'Employee_Salary': ['mean', 'min', 'max']})

                               Employee_Salary
                                          mean    min       max
Company_Name
Andrade LLC                      497237.159385   40.0  999850.0
Baker, Allen and Edwards         498032.358445   50.0  999950.0
Bullock-Carrillo                 499603.804865   40.0  999930.0
Campos, Reynolds and Mccormick   503528.982687   10.0  999970.0
James and Sons                   503581.015754   30.0  999960.0
Johnston, Fleming and Tanner     500579.128010   10.0  999920.0
Marshall-Holloway                502314.169445   30.0  999900.0
Matthews Inc                     501640.159488   80.0  999920.0
Nelson-Li                        500569.824558   30.0  999930.0
Nichols-James                    497881.232334   40.0  999950.0
Scott Inc                        500491.809024   20.0  999950.0
Taylor-Ramos                     498747.292516  160.0  999990.0
Thomas-Spencer                   499350.850164   60.0  999980.0
Wallace, Smith and Shepard       500807.608810   10.0  999950.0
White, Mcclain and Cobb          499083.493806    0.0  999980.0

In [131]:
# Applying a rolling function
df['Employee_Salary'].rolling(window=3).mean()

0                   NaN
1                   NaN
2         513833.333333
3         445460.000000
4         423596.333333
              ...
299995    232220.000000
299996    410506.666667
299997    617360.000000
299998    669883.333333
299999    545280.000000
Name: Employee_Salary, Length: 300000, dtype: float64

In [137]:
# How many unique names exist in the dataset for every company
df.groupby(by=['Company_Name']).agg({'Name':'nunique'})

                                 Name
Company_Name
Andrade LLC                     17741
Baker, Allen and Edwards        17812
Bullock-Carrillo                17778
Campos, Reynolds and Mccormick  17545
James and Sons                  17638
Johnston, Fleming and Tanner    17526
Marshall-Holloway               17528
Matthews Inc                    17760
Nelson-Li                       17848
Nichols-James                   17680
Scott Inc                       18090
Taylor-Ramos                    17908
Thomas-Spencer                  17842
Wallace, Smith and Shepard      17188
White, Mcclain and Cobb         17940

In [148]:
# Select the first row corresponding to every company in the dataframe
df.groupby(by=['Company_Name']).first()

,Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating,salary_rank
Company_Name,,,,,,,,
Andrade LLC,Vanessa Allen,Make,Ricardomouth,Mali,850140.0,Full Time,2.6,44878.5
"Baker, Allen and Edwards",Theresa Owens,Production engineer,Whiteside,Dominica,523499.0,Full Time,4.8,143160.0
Bullock-Carrillo,Carrie Woods,Ergonomist,New Russellton,Gabon,985290.0,Full Time,2.4,4282.5
"Campos, Reynolds and Mccormick",Michael Edwards,Ergonomist,New Cindychester,Lao People's Democratic Republic,516950.0,Full Time,2.3,145194.0
James and Sons,Spencer Adkins,Equities trader,New Russellton,Palestinian Territory,321520.0,Full Time,3.9,203737.5
"Johnston, Fleming and Tanner",Brad Scott,Production engineer,West Jamesview,Syrian Arab Republic,116400.0,Full Time,3.1,265264.0
Marshall-Holloway,David Phillips,"Radiographer, therapeutic",Kristaburgh,British Virgin Islands,58800.0,Full Time,0.6,282369.5
Matthews Inc,Vicki Beard,Diplomatic Services operational officer,Kristaburgh,Western Sahara,777000.0,Full Time,3.3,66870.5
Nelson-Li,Micheal Fitzgerald,Diplomatic Services operational officer,Whitakerbury,Switzerland,796690.0,Full Time,4.1,60945.5
Nichols-James,Julie Morton,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090.0,Full Time,4.3,123387.5
Scott Inc,Matthew Hall,Regulatory affairs officer,Wardfort,Anguilla,630890.0,Full Time,3.1,110786.0
Taylor-Ramos,Lisa French,"Radiographer, therapeutic",West Jamesview,Kuwait,870580.0,Full Time,1.3,38802.5
Thomas-Spencer,Gail Rose,Patent examiner,Whitakerbury,Finland,178570.0,Full Time,1.9,246642.5
"Wallace, Smith and Shepard",Ronald Clark,Regulatory affairs officer,North Melissafurt,Palau,914110.0,Full Time,3.2,25640.0
"White, Mcclain and Cobb",Victoria Sutton,Naval architect,Whiteside,Poland,656260.0,Full Time,4.9,103080.0

In [166]:
# Define a function to map salary to categories
def categorize_salary(salary):
    if salary >= 600000:
        return 'High'
    elif 300000 < salary < 600000:
        return 'Medium'
    else:
        return 'Low'

# Apply the function to the 'Employee_Salary' column
df['Employee_Salary'].apply(categorize_salary)

0         Medium
1         Medium
2           High
3            Low
4         Medium
           ...
299995       Low
299996      High
299997      High
299998       Low
299999    Medium
Name: Employee_Salary, Length: 300000, dtype: object

In [171]:
# Map every Company_Name to a unique integer value. Name the new column "Company_ID". 
df['Company_Name'].factorize()[0]

array([0, 1, 2, ..., 1, 1, 0], dtype=int64)

In [175]:
# print 25th, 50th, 75th percentile
df['Employee_Salary'].quantile([0.25,0.5,0.75])

0.25    250000.0
0.50    500780.0
0.75    749710.0
Name: Employee_Salary, dtype: float64

In [176]:
# Distribute the 'Employee_Salary' column into 10 equal-sized bins
pd.cut(df['Employee_Salary'], bins=10)

0         (299997.0, 399996.0]
1         (499995.0, 599994.0]
2         (599994.0, 699993.0]
3          (99999.0, 199998.0]
4         (499995.0, 599994.0]
                  ...
299995      (-999.99, 99999.0]
299996    (899991.0, 999990.0]
299997    (799992.0, 899991.0]
299998    (199998.0, 299997.0]
299999    (499995.0, 599994.0]
Name: Employee_Salary, Length: 300000, dtype: category
Categories (10, interval[float64, right]): [(-999.99, 99999.0] < (99999.0, 199998.0] < (199998.0, 299997.0] < (299997.0, 399996.0] ... (599994.0, 699993.0] < (699993.0, 799992.0] < (799992.0, 899991.0] < (899991.0, 999990.0]]

In [ ]:
# Sort DataFrame based on another list
df['Company_Name'].map(lambda x: order_list.index(x))

In [1]:
df.notnull().sum()

NameError: name 'df' is not defined

In [6]:
# cumulative sum
df['Employee_Salary'].cumsum()

0               321520
1               910610
2              1541500
3              1657900
4              2181399
              ...
299995    150064676898
299996    150065626478
299997    150066429308
299998    150066686548
299999    150067262318
Name: Employee_Salary, Length: 300000, dtype: int64

In [ ]:
# Fill NaN values in each column with the mean of that column
df_filled = df.fillna(df.mean())

In [ ]:
# Sort the DataFrame based on 'col_A' ascending and 'col_B' descending
sorted_df = df.sort_values(by=['col_A', 'col_B'], ascending=[True, False])

In [8]:
# GroupBy col_A, then compute a new column as (10*col_B/col_C)
df.groupby(by=['Company_Name']).apply(lambda x: 10*x['Employee_Rating'])

Company_Name
Andrade LLC              5         26.0
                         6         20.0
                         20        22.0
                         90         2.0
                         119       47.0
                                   ...
White, Mcclain and Cobb  299949    19.0
                         299963    22.0
                         299972    23.0
                         299993    23.0
                         299994    36.0
Name: Employee_Rating, Length: 300000, dtype: float64

In [16]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
dict(zip(mylist, myarr))

{'a': 0,
 'b': 1,
 'c': 2,
 'e': 3,
 'd': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9,
 'k': 10,
 'l': 11,
 'm': 12,
 'n': 13,
 'o': 14,
 'p': 15,
 'q': 16,
 'r': 17,
 's': 18,
 't': 19,
 'u': 20,
 'v': 21,
 'w': 22,
 'x': 23,
 'y': 24,
 'z': 25}